
#include <iostream>
#include <limits>
#include <assert.h>
#include <cstring>
#include <string>
#include <map>
#include <vector>
#include <iterator>
#include <algorithm>
#include <time.h>
#include <windows.h>
#include <sysinfoapi.h>
#include <regex>

#include "array_func.h"
#include "ConsoleWork.h"
#include "queue.h"
#include "test_queue.h"
#include "stack_filo.h"

using namespace std;

//Написать функцию проверяющую является ли переданное в неё бинарное дерево сбалансированным и написать программу, которая:
//создаст [50] деревьев по [10000] узлов и заполнит узлы случайными целочисленными значениями;
//рассчитает, какой процент из созданных деревьев является сбалансированными.
//Написать рекурсивную функцию бинарного поиска в дереве хранящемся в узлах, а не в массиве.

int main(int argc, char** argv) {

    std::cout << "\t\tall tests passed OK" << std::endl;

    return 0;
}
